test/tests/multiapps/warm_plate/buoyantCavity/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar>
1050
(
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
...
)
;

boundaryField
{
    left_back
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar>
150
(
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
...
)
;
    }
    left_bottom
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 2.84742140035087;
    }
    left_left
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar>
15
(
3.03724759543547
3.41690568042395
3.79656376542698
4.17621615558164
4.55587424057012
4.93553232557315
5.31518471571326
5.69484280071629
6.07450088570477
6.45415327585943
6.83381136086246
7.21346944585093
7.59312183600559
7.97277992099407
8.3524380059971
)
;
    }
    left_front
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar>
150
(
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
...
)
;
    }
    left_top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 8.54226420106716;
    }
    int_back
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar>
300
(
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
...
)
;
    }
    int_bottom
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 1.70845284021925;
    }
    int_front
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar>
300
(
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
...
)
;
    }
    int_top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 8.54226420106716;
    }
    right_back
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar>
600
(
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
...
)
;
    }
    right_bottom
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 2.84742140035087;
    }
    right_front
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar>
600
(
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
3.03724759543547
...
)
;
    }
    right_right
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar>
15
(
3.03724759543547
3.41690568042395
3.79656376542698
4.17621615558164
4.55587424057012
4.93553232557315
5.31518471571326
5.69484280071629
6.07450088570477
6.45415327585943
6.83381136086246
7.21346944585093
7.59312183600559
7.97277992099407
8.3524380059971
)
;
    }
    right_top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 8.54226420106716;
    }
}


// ************************************************************************* //
